/*Напишите программу, которая приглашает пользователя ввести его имя и
фамилию, затем построит, сохранит и отобразит третью строку, состоящую
из фамилии, за которой следует запятая, пробел и имя. Используйте обьекты
string и методы из заголовочного файла string. Пример запуска должен
выглядеть так:
Enter your first name: Flip
Enter your last name: Fleming
Here's the information in a single string: Fleming, Flip*/

#include <iostream>
#include<string>

int main()
{
	using namespace std;
	string s_first_name;
	string s_last_name;

	cout << "Enter your first name: ";
	getline(cin, s_first_name);
	cout << "Enter your last name: ";
	getline(cin, s_last_name);

	cout << "Here's the information in a single string: ";
	cout << s_last_name << ", " << s_first_name;
	cin.get();
	return 0;
}
